lheywang/EtherBenchProbe/cubeMX/cubeMX.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_2
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,MonitoredBy-0\#ChannelRegularConversion,NbrOfConversionFlag,master
ADC1.MonitoredBy-0\#ChannelRegularConversion=__NULL
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
ADC1.master=1
BOOTPATH.BootPathName=LEGACY
BOOTPATH.IPParameters=BootPathName
BOOTPATH.UserSelectedBootPath=LEGACY
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M33_NS.userName=CORTEX_M33
DAC1.DAC_Channel-DAC_OUT1=DAC_CHANNEL_1
DAC1.DAC_Channel-DAC_OUT2=DAC_CHANNEL_2
DAC1.IPParameters=DAC_Channel-DAC_OUT2,DAC_Channel-DAC_OUT1
ETH.IPParameters=MediaInterface
ETH.MediaInterface=HAL_ETH_RMII_MODE
FDCAN1.CalculateBaudRateNominal=1333333
FDCAN1.CalculateTimeBitNominal=750
FDCAN1.CalculateTimeQuantumNominal=250.0
FDCAN1.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal
File.Version=6
GPIO.groupedBy=Group By Peripherals
I2C2.IPParameters=Timing
I2C2.Timing=0x10707DBC
I2C4.IPParameters=Timing,Timeout
I2C4.Timeout=0x0000830D
I2C4.Timing=0x10707DBC
I3C1.BusFreeDuration=1086
I3C1.BusUsage=MixedUsage
I3C1.DutyCycleI3C=4
I3C1.IPParameters=SCLODLowDuration,SCLPPLowDuration,SCLI3CHighDuration,Register0,BusFreeDuration,hexBusIdleDuration,hexBusFreeDuration,Register1,SCL_OD_Freq,SCL_PP_Freq,BusUsage,DutyCycleI3C,SCLI2CHighDuration
I3C1.Register0=0x122c022f
I3C1.Register1=0x0022003e
I3C1.SCLI2CHighDuration=0x12
I3C1.SCLI3CHighDuration=0x02
I3C1.SCLODLowDuration=0x2c
I3C1.SCLPPLowDuration=0x2f
I3C1.SCL_OD_Freq=1333
I3C1.SCL_PP_Freq=1255
I3C1.hexBusFreeDuration=0x22
I3C1.hexBusIdleDuration=0x3e
KeepUserPlacement=false
MMTAppReg1.MEMORYMAP.AP=RW_priv_only
MMTAppReg1.MEMORYMAP.AppRegionName=RAM
MMTAppReg1.MEMORYMAP.ContextName=CortexM33
MMTAppReg1.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg1.MEMORYMAP.DefaultDataRegion=true
MMTAppReg1.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,AP
MMTAppReg1.MEMORYMAP.Name=RAM
MMTAppReg1.MEMORYMAP.Size=655360
MMTAppReg1.MEMORYMAP.StartAddress=0x20000000
MMTAppReg2.MEMORYMAP.AppRegionName=RAM Reserved Alias Region
MMTAppReg2.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg2.MEMORYMAP.DefaultDataRegion=false
MMTAppReg2.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg2.MEMORYMAP.Name=RAM Reserved Alias Region
MMTAppReg2.MEMORYMAP.ReservedRegion=true
MMTAppReg2.MEMORYMAP.Size=655360
MMTAppReg2.MEMORYMAP.StartAddress=0x0A000000
MMTAppReg3.MEMORYMAP.AP=RO_priv_only
MMTAppReg3.MEMORYMAP.AppRegionName=FLASH
MMTAppReg3.MEMORYMAP.Cacheability=WTRA
MMTAppReg3.MEMORYMAP.ContextName=CortexM33
MMTAppReg3.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg3.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg3.MEMORYMAP.DefaultDataRegion=false
MMTAppReg3.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg3.MEMORYMAP.MemType=ROM
MMTAppReg3.MEMORYMAP.Name=FLASH
MMTAppReg3.MEMORYMAP.Size=2097152
MMTAppReg3.MEMORYMAP.StartAddress=0x08000000
MMTAppRegionsCount=3
MMTConfigApplied=false
MMTSectionSuffix=
Mcu.CPN=STM32H563IIK6
Mcu.ContextProject=TrustZoneDisabled
Mcu.Family=STM32H5
Mcu.IP0=ADC1
Mcu.IP1=BOOTPATH
Mcu.IP10=FMAC
Mcu.IP11=I2C2
Mcu.IP12=I2C4
Mcu.IP13=I3C1
Mcu.IP14=ICACHE
Mcu.IP15=MEMORYMAP
Mcu.IP16=NVIC
Mcu.IP17=OCTOSPI1
Mcu.IP18=PWR
Mcu.IP19=RCC
Mcu.IP2=CORDIC
Mcu.IP20=RTC
Mcu.IP21=SDMMC2
Mcu.IP22=SPI2
Mcu.IP23=SPI3
Mcu.IP24=SPI4
Mcu.IP25=SYS
Mcu.IP26=TIM1
Mcu.IP27=TIM2
Mcu.IP28=TIM3
Mcu.IP29=TIM13
Mcu.IP3=CORTEX_M33_NS
Mcu.IP30=UART4
Mcu.IP31=UART5
Mcu.IP32=UART9
Mcu.IP33=UCPD1
Mcu.IP34=USART10
Mcu.IP35=USART11
Mcu.IP36=USB
Mcu.IP37=USBPD
Mcu.IP4=CRC
Mcu.IP5=DAC1
Mcu.IP6=DCACHE1
Mcu.IP7=DEBUG
Mcu.IP8=ETH
Mcu.IP9=FDCAN1
Mcu.IPNb=38
Mcu.Name=STM32H563IIKx
Mcu.Package=UFBGA176
Mcu.Pin0=PE3
Mcu.Pin1=PE2
Mcu.Pin10=PD7
Mcu.Pin100=PB13
Mcu.Pin101=PD9
Mcu.Pin102=PD8
Mcu.Pin103=PA3
Mcu.Pin104=PA7
Mcu.Pin105=PB1
Mcu.Pin106=PF11
Mcu.Pin107=PF14
Mcu.Pin108=PE12
Mcu.Pin109=PB10
Mcu.Pin11=PC12
Mcu.Pin110=PB11
Mcu.Pin111=PB14
Mcu.Pin112=PB15
Mcu.Pin113=VP_ADC1_TempSens_Input
Mcu.Pin114=VP_ADC1_Vref_Input
Mcu.Pin115=VP_CORDIC_VS_CORDIC
Mcu.Pin116=VP_CORTEX_M33_NS_VS_Hclk
Mcu.Pin117=VP_CRC_VS_CRC
Mcu.Pin118=VP_DCACHE1_VS_DCACHE
Mcu.Pin119=VP_FMAC_VS_FMAC
Mcu.Pin12=PA15(JTDI)
Mcu.Pin120=VP_ICACHE_VS_ICACHE
Mcu.Pin121=VP_ICACHE_VS_ENABLE_ICACHE_MEMORY
Mcu.Pin122=VP_PWR_VS_SECSignals
Mcu.Pin123=VP_PWR_VS_LPOM
Mcu.Pin124=VP_RTC_VS_RTC_Activate
Mcu.Pin125=VP_RTC_VS_RTC_Calendar
Mcu.Pin126=VP_SYS_VS_tim6
Mcu.Pin127=VP_TIM1_VS_ClockSourceINT
Mcu.Pin128=VP_TIM2_VS_ClockSourceINT
Mcu.Pin129=VP_TIM3_VS_ClockSourceINT
Mcu.Pin13=PA14(JTCK/SWCLK)
Mcu.Pin130=VP_TIM13_VS_ClockSourceINT
Mcu.Pin131=VP_USBPD_VS_USBPD1
Mcu.Pin132=VP_USBPD_VS_PD3FULL
Mcu.Pin133=VP_USBPD_VS_usbpd_tim4
Mcu.Pin134=VP_BOOTPATH_VS_BOOTPATH
Mcu.Pin135=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin14=PA13(JTMS/SWDIO)
Mcu.Pin15=PE4
Mcu.Pin16=PE5
Mcu.Pin17=PE6
Mcu.Pin18=PB9
Mcu.Pin19=PB6
Mcu.Pin2=PE1
Mcu.Pin20=PG12
Mcu.Pin21=PG11
Mcu.Pin22=PG10
Mcu.Pin23=PD6
Mcu.Pin24=PD0
Mcu.Pin25=PC10
Mcu.Pin26=PA12
Mcu.Pin27=PI7
Mcu.Pin28=PI6
Mcu.Pin29=PI5
Mcu.Pin3=PE0
Mcu.Pin30=PG9
Mcu.Pin31=PD1
Mcu.Pin32=PI3
Mcu.Pin33=PI2
Mcu.Pin34=PA11
Mcu.Pin35=PC13
Mcu.Pin36=PI8
Mcu.Pin37=PI9
Mcu.Pin38=PI4
Mcu.Pin39=PD3
Mcu.Pin4=PB8
Mcu.Pin40=PD2
Mcu.Pin41=PI1
Mcu.Pin42=PC14-OSC32_IN(OSC32_IN)
Mcu.Pin43=PF0
Mcu.Pin44=PI11
Mcu.Pin45=PH13
Mcu.Pin46=PA9
Mcu.Pin47=PC15-OSC32_OUT(OSC32_OUT)
Mcu.Pin48=PH2
Mcu.Pin49=PC9
Mcu.Pin5=PB5
Mcu.Pin50=PA8
Mcu.Pin51=PH0-OSC_IN(PH0)
Mcu.Pin52=PC7
Mcu.Pin53=PH1-OSC_OUT(PH1)
Mcu.Pin54=PF1
Mcu.Pin55=PH4
Mcu.Pin56=PC6
Mcu.Pin57=PF3
Mcu.Pin58=PF4
Mcu.Pin59=PH5
Mcu.Pin6=PG14
Mcu.Pin60=PG7
Mcu.Pin61=PG6
Mcu.Pin62=PF7
Mcu.Pin63=PF6
Mcu.Pin64=PF5
Mcu.Pin65=PH12
Mcu.Pin66=PG4
Mcu.Pin67=PG3
Mcu.Pin68=PF10
Mcu.Pin69=PF9
Mcu.Pin7=PG13
Mcu.Pin70=PF8
Mcu.Pin71=PH10
Mcu.Pin72=PD15
Mcu.Pin73=PG2
Mcu.Pin74=PC1
Mcu.Pin75=PC2
Mcu.Pin76=PC3
Mcu.Pin77=PG1
Mcu.Pin78=PH6
Mcu.Pin79=PH8
Mcu.Pin8=PB4(NJTRST)
Mcu.Pin80=PH9
Mcu.Pin81=PD14
Mcu.Pin82=PD13
Mcu.Pin83=PA1
Mcu.Pin84=PA4
Mcu.Pin85=PC4
Mcu.Pin86=PG0
Mcu.Pin87=PE13
Mcu.Pin88=PH7
Mcu.Pin89=PD12
Mcu.Pin9=PB3(JTDO/TRACESWO)
Mcu.Pin90=PD10
Mcu.Pin91=PA2
Mcu.Pin92=PA6
Mcu.Pin93=PA5
Mcu.Pin94=PC5
Mcu.Pin95=PF15
Mcu.Pin96=PE9
Mcu.Pin97=PE11
Mcu.Pin98=PE14
Mcu.Pin99=PB12
Mcu.PinsNb=136
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32H563IIKx
MxCube.Version=6.16.1
MxDb.Version=DB.6.0.161
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC.TIM6_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.TimeBase=TIM6_IRQn
NVIC.TimeBaseIP=TIM6
NVIC.UCPD1_IRQn=true\:0\:0\:false\:false\:true\:true\:false\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA1.Mode=RMII
PA1.Signal=ETH_REF_CLK
PA11.Mode=Device
PA11.Signal=USB_DM
PA12.Mode=Device
PA12.Signal=USB_DP
PA13(JTMS/SWDIO).Mode=Serial_Wire
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14(JTCK/SWCLK).Mode=Serial_Wire
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA15(JTDI).GPIOParameters=GPIO_Label
PA15(JTDI).GPIO_Label=LED_5
PA15(JTDI).Signal=S_TIM2_CH1
PA2.Mode=RMII
PA2.Signal=ETH_MDIO
PA3.GPIOParameters=GPIO_Label
PA3.GPIO_Label=LED_8
PA3.Signal=S_TIM2_CH4
PA4.Signal=COMP_DAC11_group
PA5.Signal=COMP_DAC12_group
PA6.GPIOParameters=GPIO_Label
PA6.GPIO_Label=ARGB
PA6.Signal=S_TIM13_CH1
PA7.Mode=RMII
PA7.Signal=ETH_CRS_DV
PA8.Locked=true
PA8.Mode=Clock-out
PA8.Signal=RCC_MCO_1
PA9.Locked=true
PA9.Mode=EnableDeadBattery
PA9.Signal=UCPD1_DB1
PB1.Signal=ADCx_INP5
PB10.GPIOParameters=GPIO_Label
PB10.GPIO_Label=LED_7
PB10.Signal=S_TIM2_CH3
PB11.Locked=true
PB11.Mode=RMII
PB11.Signal=ETH_TX_EN
PB12.Locked=true
PB12.Mode=RMII
PB12.Signal=ETH_TXD0
PB13.Mode=Sink_AllSignals
PB13.Signal=UCPD1_CC1
PB14.Mode=Sink_AllSignals
PB14.Signal=UCPD1_CC2
PB15.Locked=true
PB15.Mode=RMII
PB15.Signal=ETH_TXD1
PB3(JTDO/TRACESWO).GPIOParameters=GPIO_Label
PB3(JTDO/TRACESWO).GPIO_Label=LED_6
PB3(JTDO/TRACESWO).Signal=S_TIM2_CH2
PB4(NJTRST).Mode=Full_Duplex_Master
PB4(NJTRST).Signal=SPI3_MISO
PB5.Mode=Asynchronous
PB5.Signal=UART5_RX
PB6.Mode=Asynchronous
PB6.Signal=UART5_TX
PB8.Locked=true
PB8.Mode=Controller
PB8.Signal=I3C1_SCL
PB9.Mode=Controller
PB9.Signal=I3C1_SDA
PC1.Mode=RMII
PC1.Signal=ETH_MDC
PC10.Mode=Full_Duplex_Master
PC10.Signal=SPI3_SCK
PC12.Locked=true
PC12.Mode=Full_Duplex_Master
PC12.Signal=SPI3_MOSI
PC13.GPIOParameters=GPIO_Label
PC13.GPIO_Label=MODULE_PRESENT
PC13.Locked=true
PC13.Signal=GPIO_Input
PC14-OSC32_IN(OSC32_IN).Mode=LSE-External-Oscillator
PC14-OSC32_IN(OSC32_IN).Signal=RCC_OSC32_IN
PC15-OSC32_OUT(OSC32_OUT).Mode=LSE-External-Oscillator
PC15-OSC32_OUT(OSC32_OUT).Signal=RCC_OSC32_OUT
PC2.GPIOParameters=GPIO_Label
PC2.GPIO_Label=CC1
PC2.Signal=ADCx_INP12
PC3.GPIOParameters=GPIO_Label
PC3.GPIO_Label=CC2
PC3.Signal=ADCx_INP13
PC4.Mode=RMII
PC4.Signal=ETH_RXD0
PC5.Mode=RMII
PC5.Signal=ETH_RXD1
PC6.GPIOParameters=GPIO_Label
PC6.GPIO_Label=PWM_FAN
PC6.Locked=true
PC6.Signal=S_TIM3_CH1
PC7.Locked=true
PC7.Signal=GPIO_Output
PC9.Locked=true
PC9.Mode=EnableDeadBattery
PC9.Signal=UCPD1_DB2
PCC.Checker=false
PCC.Line=STM32H563/H573
PCC.MCU=STM32H563IIKx
PCC.PartNumber=STM32H563IIKx
PCC.Series=STM32H5
PCC.Temperature=25
PCC.Vdd=3.0
PD0.Mode=Asynchronous
PD0.Signal=UART4_RX
PD1.Mode=Asynchronous
PD1.Signal=UART4_TX
PD10.GPIOParameters=GPIO_Speed
PD10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PD10.Locked=true
PD10.Signal=EVENTOUT
PD12.GPIOParameters=GPIO_Label
PD12.GPIO_Label=REQ_RESET
PD12.Locked=true
PD12.Signal=GPIO_Input
PD13.GPIOParameters=GPIO_Label
PD13.GPIO_Label=INTERCOM_IN
PD13.Locked=true
PD13.Signal=GPIO_Input
PD14.Mode=Asynchronous
PD14.Signal=UART9_RX
PD15.Mode=Asynchronous
PD15.Signal=UART9_TX
PD2.GPIOParameters=GPIO_Label
PD2.GPIO_Label=USB_SUSP
PD2.Locked=true
PD2.Signal=GPIO_Input
PD3.GPIOParameters=GPIO_Label
PD3.GPIO_Label=USB_HS
PD3.Locked=true
PD3.Signal=GPIO_Input
PD6.Mode=SD_4_bits_Wide_bus
PD6.Signal=SDMMC2_CK
PD7.Mode=SD_4_bits_Wide_bus
PD7.Signal=SDMMC2_CMD
PD8.GPIOParameters=GPIO_ModeDefaultEXTI
PD8.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
PD8.Locked=true
PD8.Signal=GPXTI8
PD9.GPIOParameters=GPIO_Label
PD9.GPIO_Label=ETH_RESET
PD9.Locked=true
PD9.Signal=GPIO_Output
PE0.Locked=true
PE0.Mode=FDCAN_Activate
PE0.Signal=FDCAN1_RX
PE1.Locked=true
PE1.Mode=FDCAN_Activate
PE1.Signal=FDCAN1_TX
PE11.Locked=true
PE11.Mode=quad_mode
PE11.Signal=OCTOSPI1_NCS
PE12.Mode=Full_Duplex_Master
PE12.Signal=SPI4_SCK
PE13.GPIOParameters=GPIO_Label
PE13.GPIO_Label=LED_3
PE13.Signal=S_TIM1_CH3
PE14.GPIOParameters=GPIO_Label
PE14.GPIO_Label=LED_4
PE14.Signal=S_TIM1_CH4
PE2.Mode=Asynchronous
PE2.Signal=USART10_RX
PE3.Locked=true
PE3.Mode=Asynchronous
PE3.Signal=USART10_TX
PE4.GPIOParameters=GPIO_ModeDefaultEXTI
PE4.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
PE4.Locked=true
PE4.Signal=GPXTI4
PE5.Mode=Full_Duplex_Master
PE5.Signal=SPI4_MISO
PE6.Mode=Full_Duplex_Master
PE6.Signal=SPI4_MOSI
PE9.GPIOParameters=GPIO_Label
PE9.GPIO_Label=LED_1
PE9.Locked=true
PE9.Signal=S_TIM1_CH1
PF0.GPIOParameters=GPIO_Label
PF0.GPIO_Label=MGMNT_SDA
PF0.Mode=I2C
PF0.Signal=I2C2_SDA
PF1.GPIOParameters=GPIO_Label
PF1.GPIO_Label=MGMNT_SCL
PF1.Mode=I2C
PF1.Signal=I2C2_SCL
PF10.Locked=true
PF10.Mode=quad_mode
PF10.Signal=OCTOSPI1_CLK
PF11.Mode=IN2-Single-Ended
PF11.Signal=ADC1_INP2
PF14.GPIOParameters=GPIO_Label
PF14.GPIO_Label=DBG_O4
PF14.Locked=true
PF14.Signal=GPIO_Output
PF15.GPIOParameters=GPIO_Label
PF15.GPIO_Label=DBG_O3
PF15.Locked=true
PF15.Signal=GPIO_Output
PF3.Mode=Asynchronous
PF3.Signal=USART11_TX
PF4.Mode=Asynchronous
PF4.Signal=USART11_RX
PF5.Mode=SMBus-Alert-mode
PF5.Signal=I2C4_SCL
PF6.Locked=true
PF6.Mode=OCTOSPI1_IO[3\:0]
PF6.Signal=OCTOSPI1_IO3
PF7.Locked=true
PF7.Mode=OCTOSPI1_IO[3\:0]
PF7.Signal=OCTOSPI1_IO2
PF8.Locked=true
PF8.Mode=OCTOSPI1_IO[3\:0]
PF8.Signal=OCTOSPI1_IO0
PF9.Locked=true
PF9.Mode=OCTOSPI1_IO[3\:0]
PF9.Signal=OCTOSPI1_IO1
PG0.GPIOParameters=GPIO_Label
PG0.GPIO_Label=DBG_O2
PG0.Locked=true
PG0.Signal=GPIO_Output
PG1.GPIOParameters=GPIO_Label
PG1.GPIO_Label=DGB_O1
PG1.Locked=true
PG1.Signal=GPIO_Output
PG10.Mode=SD_4_bits_Wide_bus
PG10.Signal=SDMMC2_D1
PG11.Mode=SD_4_bits_Wide_bus
PG11.Signal=SDMMC2_D2
PG12.Mode=SD_4_bits_Wide_bus
PG12.Signal=SDMMC2_D3
PG13.Mode=CTS_RTS
PG13.Signal=USART10_CTS
PG14.Mode=CTS_RTS
PG14.Signal=USART10_RTS
PG2.GPIOParameters=GPIO_Label
PG2.GPIO_Label=INTERCOM_OUT
PG2.Locked=true
PG2.Signal=GPIO_Output
PG3.GPIOParameters=GPIO_Label
PG3.GPIO_Label=DBG_LED2
PG3.Locked=true
PG3.Signal=GPIO_Output
PG4.GPIOParameters=GPIO_Label
PG4.GPIO_Label=DBG_LED1
PG4.Locked=true
PG4.Signal=GPIO_Output
PG6.GPIOParameters=GPIO_Label
PG6.GPIO_Label=DBG_IN2
PG6.Locked=true
PG6.Signal=GPIO_Input
PG7.GPIOParameters=GPIO_Label
PG7.GPIO_Label=DBG_IN1
PG7.Locked=true
PG7.Signal=GPIO_Input
PG9.Mode=SD_4_bits_Wide_bus
PG9.Signal=SDMMC2_D0
PH0-OSC_IN(PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN(PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT(PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT(PH1).Signal=RCC_OSC_OUT
PH10.Locked=true
PH10.Mode=SMBus-Alert-mode
PH10.Signal=I2C4_SMBA
PH12.Locked=true
PH12.Mode=SMBus-Alert-mode
PH12.Signal=I2C4_SDA
PH13.GPIOParameters=GPIO_Label
PH13.GPIO_Label=USB_RESET
PH13.Locked=true
PH13.Signal=GPIO_Output
PH2.GPIOParameters=GPIO_Label
PH2.GPIO_Label=GPIO_OD_IN2
PH2.Locked=true
PH2.Signal=GPIO_Input
PH4.GPIOParameters=GPIO_Label
PH4.GPIO_Label=DUT_PRESENT
PH4.Locked=true
PH4.Signal=GPIO_Input
PH5.GPIOParameters=GPIO_Label
PH5.GPIO_Label=DUT_RESET
PH5.Locked=true
PH5.Signal=GPIO_Output
PH6.GPIOParameters=GPIO_Label
PH6.GPIO_Label=ACT0
PH6.Locked=true
PH6.Signal=GPIO_Input
PH7.GPIOParameters=GPIO_Label
PH7.GPIO_Label=ACT2
PH7.Locked=true
PH7.Signal=GPIO_Input
PH8.GPIOParameters=GPIO_Label
PH8.GPIO_Label=ACT1
PH8.Locked=true
PH8.Signal=GPIO_Input
PH9.GPIOParameters=GPIO_Label
PH9.GPIO_Label=LED_2
PH9.Signal=S_TIM1_CH2
PI1.Locked=true
PI1.Mode=Full_Duplex_Slave
PI1.Signal=SPI2_SCK
PI11.GPIOParameters=GPIO_Label
PI11.GPIO_Label=GPIO_OD_IN1
PI11.Locked=true
PI11.Signal=GPIO_Input
PI2.Mode=Full_Duplex_Slave
PI2.Signal=SPI2_MISO
PI3.Mode=Full_Duplex_Slave
PI3.Signal=SPI2_MOSI
PI4.GPIOParameters=GPIO_Label
PI4.GPIO_Label=GPIO_PP_2
PI4.Locked=true
PI4.Signal=GPIO_Input
PI5.Locked=true
PI5.Signal=GPIO_Input
PI6.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
PI6.GPIO_Label=BUCK_INT
PI6.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
PI6.Locked=true
PI6.Signal=GPXTI6
PI7.GPIOParameters=GPIO_Label
PI7.GPIO_Label=BUCK_ENABLE
PI7.Locked=true
PI7.Signal=GPIO_Output
PI8.GPIOParameters=GPIO_Label
PI8.GPIO_Label=GPIO_OD_1
PI8.Locked=true
PI8.Signal=GPIO_Output
PI9.Locked=true
PI9.Signal=GPIO_Output
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerLinker=GCC
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32H563IIKx
ProjectManager.FirmwarePackage=STM32Cube FW_H5 V1.5.1
ProjectManager.FreePins=false
ProjectManager.FreePinsContext=
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=0
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=cubeMX.ioc
ProjectManager.ProjectName=cubeMX
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=EWARM V9.20
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true,3-MX_ADC1_Init-ADC1-false-HAL-true,4-MX_CORDIC_Init-CORDIC-false-HAL-true,5-MX_CRC_Init-CRC-false-HAL-true,6-MX_DAC1_Init-DAC1-false-HAL-true,7-MX_DCACHE1_Init-DCACHE1-false-HAL-true,8-MX_ETH_Init-ETH-false-HAL-true,9-MX_FDCAN1_Init-FDCAN1-false-HAL-true,10-MX_FMAC_Init-FMAC-false-HAL-true,11-MX_I2C2_Init-I2C2-false-HAL-true,12-MX_I2C4_SMBUS_Init-I2C4-false-HAL-true,13-MX_I3C1_Init-I3C1-false-HAL-true,14-MX_ICACHE_Init-ICACHE-false-HAL-true,15-MX_OCTOSPI1_Init-OCTOSPI1-false-HAL-true,16-MX_RTC_Init-RTC-false-HAL-true,17-MX_SDMMC2_SD_Init-SDMMC2-false-HAL-true,18-MX_SPI2_Init-SPI2-false-HAL-true,19-MX_SPI3_Init-SPI3-false-HAL-true,20-MX_TIM1_Init-TIM1-false-HAL-true,21-MX_TIM2_Init-TIM2-false-HAL-true,22-MX_TIM3_Init-TIM3-false-HAL-true,23-MX_TIM13_Init-TIM13-false-HAL-true,24-MX_UART5_Init-UART5-false-HAL-true,25-MX_UART9_Init-UART9-false-HAL-true,26-MX_USART10_UART_Init-USART10-false-HAL-true,27-MX_USART11_UART_Init-USART11-false-HAL-true,28-MX_UCPD1_Init-UCPD1-false-LL-true,29-MX_USB_PCD_Init-USB-false-HAL-true,30-MX_SPI4_Init-SPI4-false-HAL-true,31-MX_UART4_Init-UART4-false-HAL-true,0-MX_CORTEX_M33_NS_Init-CORTEX_M33_NS-false-HAL-true,0-MX_PWR_Init-PWR-false-HAL-true
RCC.ADCFreq_Value=64000000
